Revit 2024 API
ElementLogicalFilter.GetFilters Method
 Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public IList<ElementFilter> GetFilters()
Visual Basic
Public Function GetFilters As IList(Of ElementFilter)
Visual C++
public:
IList<ElementFilter^>^ GetFilters()
Return Value
 Copies of the filters that are logically combined by this ElementLogicalFilter.
See Also
ElementLogicalFilter Class
Autodesk.Revit.DB Namespace